{
 "states":[
{
"stateName":"Alabama",
"abbr":"AL",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Alabama resident.   Be at least 18 years old.   NOT been convicted of a disqualifying felony.   NOT be declared mentally incompetent by a court.   ",
"online":"   Items required:      Valid Alabama driver's license or identification card     . To register to vote online,       Visit the state's <a href='https://www.alabamainteractive.org/sos/voter_registration/voterRegistrationWelcome.action'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Valid Alabama driver's license or identification card     . To register to vote online,       Obtain State of Alabama Mail-In Voter Registration Form (Form NVRA-2) by mail by filling out the <a href='https://www.alabamainteractive.org/sos/voter_registration/voterRegistrationWelcome.action'> online form request</a>, printing it out <a href='http://sos.alabama.gov/sites/default/files/voter-pdfs/nvra-2.pdf'> here</a>, or by calling (800) 274-8683.   Complete State of Alabama Mail-In Voter Registration Form (Form NVRA-2).    Return form to    your local AL county office of Board of Registrars   an AL DMV driver licensing office when you apply for or renew your driver's license or ID card   any other government agency such as Medicaid agencies, Department of Human Resources, County public library.        ",
"mail":"   Items required:      Valid Alabama driver's license or identification card     . To register to vote online,       Obtain State of Alabama Mail-In Voter Registration Form (Form NVRA-2) by mail by filling out the <a href='https://www.alabamainteractive.org/sos/voter_registration/voterRegistrationWelcome.action'> online form request</a>, printing it out <a href='http://sos.alabama.gov/sites/default/files/voter-pdfs/nvra-2.pdf'> here</a>, or by calling (800) 274-8683.   Complete State of Alabama Mail-In Voter Registration Form (Form NVRA-2).    Return form to your local AL county office of Board of Registrars    ",
"url":"https://www.alabamainteractive.org/sos/voter_registration/voterRegistrationWelcome.action",
"absentee":"   Items required:      Item     . To register to vote online,       step1   "
},
{
"stateName":"Alaska",
"abbr":"AK",
"eligibility":" Eligibility to register    Be a U.S. citizen.  Be a resident of Alaska.  Be at least 18 years old, or within 90 days of turning 18 years old.  NOT convicted and currently serving incarceration, parole, probation for a disqualifying felony*.  NOT be registered to vote in another state.  ",
"online":"  Items required:    Valid Alaska driver's license or ID card   . To register to vote online,     Visit the state's <a href='https://voterregistration.alaska.gov/'>Online Voter Registration System.</a> and follow the prompts asyou complete the online form.  ",
"inPerson":"  Items required:    Valid Alaska driver's license or ID card   . To register to vote online,     Register to vote or update your registration in person at a<a href='http://elections.alaska.gov/Core/contactusandsitemap.php'>Division of Elections Office</a>, or visit a<a href='http://elections.alaska.gov/Core/wheretoregister.php'>voter registration agency</a> in your area.  ",
"mail":"  Items required:    Valid Alaska driver's license or ID card   . To register to vote online,     Print a <a href='http://elections.alaska.gov/doc/forms/C03.pdf'>paper</a> form to complete and sign.   Send your completed form by mail, fax or email attachment to a<a href='http://elections.alaska.gov/Core/contactregionalelectionsoffices.php'>Regional Elections Office.  Send a copy of either your current driver’s license, state ID, passportor birth certificate with your paper form.  ",
"url":"http://elections.alaska.gov/Core/voterregistration.php",
"absentee":"coming soon"
},
{
"stateName":"Arizona",
"abbr":"AZ",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident of the Arizona county listed on your registration.   Be at least 18 years old on or before the date of the next general election.   NOT disqualified from voting at this time due to felony conviction(s).   NOT be declared 'incompetent' by a court.   Must register to vote at least 29 days before the next election to be able to vote in it.    ",
"online":"   Items required:      Name, as it appears on your driver's license or ID card.   Address   Social Security number.     . To register to vote online,       Visit the state's <a href='https://servicearizona.com/voterRegistration'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Proof of your U.S. citizenship, such as a photocopy of your birth certificate or U.S. passport.     . To register to vote online,       Pick up an Arizona Voter Registration Form form at your local County Recorder, or print it out <a href='https://www.azsos.gov/sites/azsos.gov/files/voter_registration_form.pdf'> here</a>   Complete the form.   Return the form and your proof of U.S. citizenship to your <a href='https://www.azsos.gov/elections/voting-election/contact-information-county-election-officials'> local County Recorder</a>.   You can also register to vote at your local AZ MVD office when you apply for an Arizona driver's license or identification card.    ",
"mail":"   Items required:      Proof of your U.S. citizenship, such as a photocopy of your birth certificate or U.S. passport.     . To register to vote online,       Print the <a href='https://www.azsos.gov/sites/azsos.gov/files/voter_registration_form.pdf'> Arizona Voter Registration Form   Complete the form.   Mail the form and your proof of U.S. citizenship to your <a href='https://www.azsos.gov/elections/voting-election/contact-information-county-election-officials'> local County Recorder</a>.    ",
"url":"https://servicearizona.com/webapp/evoter/selectLanguage",
"absentee":"coming soon"
},
{
"stateName":"Arkansas",
"abbr":"AR",
"eligibility":"  Eligibility to register     Be a U.S. citizen.   Be an Arkansas resident (residing in Arkansas at least 30 days prior to the first election in which you will vote).   Be age 18 or turn 18 on or before the next election.   Not be a convicted felon whose sentence has not been discharged or pardoned.   Not be presently adjudged as mentally incompetent as to your ability to vote by a court of competent jurisdiction.    ",
"online":"none",
"inPerson":"   Items required:      Valid Arkansas driver's license or identification card     . To register to vote online,     You can complete an in-person voter registration at:      Your county clerk's office.   Any AR ODS location where you complete a paper form or have your information sent electronically.   Any public library or Arkansas State Library.   Any public assistance or disability agency.   Any military recruitment or National Guard office.   Local voter registration drives.    ",
"mail":"   Items required:      Valid Arkansas driver's license or identification card, or   A copy of a current utility bill, bank statement, government check or paycheck that shows your name and address, or   Another government document that shows your name and address     . To register to vote online,       Obtain Arkansas Voter Registration Application from your local county clerk's office, from the Arkansas Secretary of State, by calling the Secretary of State Elections Division at (800) 247-3312, by filling out the <a href='http://www.sos.arkansas.gov/elections/Pages/request-app-through-mail.aspx'> online form request</a>, printing it out <a href='http://www.sos.arkansas.gov/elections/Documents/Voter_Reg_Ap_6-11.pdf'> here</a>.   Complete the form   Mail in the form on the address provided in the paper application.    ",
"url":"http://www.sos.arkansas.gov/elections/Pages/voterRegistration.aspx",
"absentee":"coming soon"
},
{
"stateName":"California",
"abbr":"CA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   A California resident.   18 years old or older on Election Day.   Not currently in prison or on parole for a felony conviction. Note that Some citizens serving certain legal sentences can vote, and those with felony convictions who've had their civil rights restored can vote.   Not found to be mentally incompetent by a court.    ",
"online":"   Items required:      Your California driver license or California identification card number   The last four digits of your social security number   Your date of birth     . To register to vote online,       Visit the<a href='http://registertovote.ca.gov/'> California Online Voter Registration</a> and follow the prompts as you complete the online form.    ",
"inPerson":"none",
"mail":"   Items required:      California driver's license or identification card number    Last 4 digits of your social security number     . To register to vote online,       Obtain National Mail Voter Registration Form by printing it <a href='https://www.eac.gov/voters/national-mail-voter-registration-form/'> here</a>, pick a registration form up at your local DMV office or county elections office, or request one by calling the voter hotline at (800) 345-8683.   Complete the form.   Mail the form to the address provided on the application.    ",
"url":"http://registertovote.ca.gov/",
"absentee":"coming soon"
},
{
"stateName":"Colorado",
"abbr":"CO",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   A Colorado resident who has lived in the state for at least 22 days before the election in which you plan to vote.   At least 18 years old by the date of the next election.   NOT currently serving a sentence of confinement, detention, or parole for a felony conviction.    ",
"online":"   Items required:      A valid Colorado driver's license, or   A Colorado ID card issued by the DMV.     . To register to vote online,       Visit the state's <a href='https://www.sos.state.co.us/voter-classic/pages/pub/olvr/verifyNewVoter.xhtml'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Valid Colorado driver's license or identification card     . To register to vote online,     You can complete an in-person voter registration at:      Your county clerk's office.   A Colorado DMV office when you apply for or renew your driver's license.   Public assistance offices.   Military recruitment offices.   Voter service and polling centers.    ",
"mail":"   Items required:      Valid Colorado driver's license or identification card     . To register to vote online,       Print the Colorado Voter Registration Form* (Form 100) <a href='http://www.sos.state.co.us/pubs/elections/vote/VoterRegFormEnglish.pdf'> here</a>, or pick up this form directly from your county clerk's office.   Complete the form.   Return form to your <a href='http://www.sos.state.co.us/pubs/elections/Resources/CountyElectionOffices.html'> county clerk's office</a>    ",
"url":"https://www.sos.state.co.us/voter-classic/pages/pub/olvr/verifyNewVoter.xhtml",
"absentee":"coming soon"
},
{
"stateName":"Connecticut",
"abbr":"CT",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   A resident of Connecticut.   At least 17 years old to register, and must be 18 years old on or before Election Day.   NOT be imprisoned or on parole. Voting rights are automatically restored upon the release of incarceration and, if applicable, parole.    ",
"online":"   Items required:      Valid CT driver's license, permit, or photo ID card, and a signature on file with the DMV.     . To register to vote online,       Visit the state's <a href='https://voterregistration.ct.gov/OLVR/registerDetails.do'> Online Voter Registration System</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Valid CT driver's license, permit, or photo ID card     . To register to vote online,       Obtain State of Connecticut Mail-In Voter Registration (Form ED-671 S) <a href='http://www.sots.ct.gov/sots/lib/sots/electionservices/electforms/electforms/voter_reg_card_english_2015.pdf'> here</a>   Complete the form.   Return form to your local town hall or voter registration office. Locations found <a href='http://www.ct.gov/sots/LIB/sots/ElectionServices/lists/ROVOfficeAddresses.pdf'> here</a>    ",
"mail":"   Items required:      Valid CT driver's license, permit, or photo ID card     . To register to vote online,       Obtain State of Connecticut Mail-In Voter Registration (Form ED-671 S) <a href='http://www.sots.ct.gov/sots/lib/sots/electionservices/electforms/electforms/voter_reg_card_english_2015.pdf'> here</a>   Complete the form.   Mail form to your local town hall or voter registration office. Address found <a href='http://www.ct.gov/sots/LIB/sots/ElectionServices/lists/ROVOfficeAddresses.pdf'> here</a>    ",
"url":"https://voterregistration.ct.gov/OLVR/welcome.do",
"absentee":"coming soon"
},
{
"stateName":"Delaware",
"abbr":"DE",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   You're a Delaware citizen.   You're at least 18 years old.   You have not been deemed mentally incompetent.   You have not committed a disqualifying felony.   If applicable, you are no longer incarcerated, on parole, or on probation.    ",
"online":"none",
"inPerson":"   Items required:      Valid Delaware driver's license or photo ID card   Proof of residency via current utility bill, bank statement, or government paystub.     . To register to vote online,     You can complete an in-person voter registration at:      your <a href='http://elections.delaware.gov/locations.shtml'>local</a> Department of Elections   Your local Delaware DMV office if you're applying, renewing, or updating your DE driver's license or state ID card.   Department of Health and Social Services.   Department of Labor.    ",
"mail":"   Items required:      Delaware driver's license or ID number.   If you have neither, provide your Social Security number.     . To register to vote online,       Visit the state's <a href='https://ivote.de.gov/voterlogin.aspx'> Online Voter Registration System</a> to complete a voter registration form online   Print, sign, and mail the application to the address provided.   If you have never registered before, you must provide copies of proof of photo identification OR proof of residency that shows your name and address with your application; otherwise, you must provide them the first time you vote in a Federal election.    ",
"url":"https://ivote.de.gov/default.aspx",
"absentee":"coming soon"
},
{
"stateName":"Florida",
"abbr":"FL",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a Florida resident.   Be at least 18 years old. You can pre-register to vote at 16 years old, but you'll need to wait until you're 18 years old to vote.   Have never been legally judged ineligible to vote, for either mental incapacitation or crime.   Have not been convicted of a felony and had your civil rights restored.   Must register at least 29 days before an election to be able to vote.    ",
"online":"none",
"inPerson":"   Items required:      Valid Florida Driver License or Florida identification Card Number     . To register to vote online,       Print Florida Voter Registration Application (Form DS-DE 39) <a href='http://dos.myflorida.com/media/693757/dsde39.pdf'> here</a>   Complete the form.   Return form to the following:    your <a href='http://dos.myflorida.com/media/695008/soe-contact-information.pdf'> local county Supervisor of Elections</a>   A FLHSMV driver's license office.   A voter registration agency.   An armed forces recruitment office.    Any public library.</li?       ",
"mail":"   Items required:      Valid Florida Driver License or Florida identification Card Number     . To register to vote online,       Print Florida Voter Registration Application (Form DS-DE 39) <a href='http://dos.myflorida.com/media/693757/dsde39.pdf'> here</a>   Complete the form.   Mail form to your local county Supervisor of Elections. Addresses found <a href='http://dos.myflorida.com/media/695008/soe-contact-information.pdf'> here</a>    ",
"url":"http://www.dmvflorida.org/voter-registration.shtml",
"absentee":"coming soon"
},
{
"stateName":"Georgia",
"abbr":"GA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Legal resident of a Georgia county.   At least 17 1/2 years old. You must be 18 years old before or on Election Day.   Have not been deemed by a judge to be mentally incompetent.   Not incarcerated, on parole or on probation for a felony conviction.    ",
"online":"   Items required:      Valid Georgia driver's license or ID card.     . To register to vote online,       Visit the state's <a href='https://registertovote.sos.ga.gov/GAOLVR/welcome.do#no-back-button'> Online Voter Registration System</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Valid Georgia driver's license or ID card.     . To register to vote online,       Go to the Georgia Department of Driver Services (DDS) when you apply for your GA driver's license or renew your GA driver's license.    ",
"mail":"   Items required:      Valid Georgia driver's license or ID card.     . To register to vote online,       Obtain the State of Georgia Application for Voter Registration from    Downloading the form <a href='http://sos.ga.gov/admin/files/Voter_Registration_Application_8-10.pdf'> here</a>   Your county board of registrar's office, or   The public library, or   Public assistance offices, or   Colleges and universities, or   Other government offices, or       Complete the form.   Mail the application to the address on the form.    ",
"url":"https://registertovote.sos.ga.gov/GAOLVR/welcometoga.do#no-back-button",
"absentee":"coming soon"
},
{
"stateName":"Hawaii",
"abbr":"HI",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   A Hawaii resident   You're at least 18 years old, or will be at the time of election. You can pre-register at 16 years old, but you can't actually vote until you turn 18 years old.   NOT be currently incarcerated   If you are a felon, your sentence must have been suspended, regardless of whether you're placed on probation, or you've been paroled after completing their imprisonment.    ",
"online":"   Items required:      Your current Hawaii Driver's License or Hawaii State ID card   Your Social Security Number     . To register to vote online,       Visit the state's <a href='https://olvr.hawaii.gov/'> Online Voter Registration System</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Proof of photo identification such as your Hawaii driver's license or ID card, or   Document that show both your name and address such as current utility bill, current bank statement, current government or other paycheck.     . To register to vote online,       Obtain the Voter Registration and Permanent Absentee Form from    Downloading the form <a href='https://olvr.hawaii.gov/'> here</a>   Public libraries, or   City halls, or   Phone directories, or   U.S. post offices, or   University of Hawaii systems, or   Register in person at any city or county clerks office or at the Office of Elections location       Complete the form.   Return it to the county elections offices listed on the application.    ",
"mail":"   Items required:      Proof of photo identification such as your Hawaii driver's license or ID card, or   Document that show both your name and address such as current utility bill, current bank statement, current government or other paycheck.     . To register to vote online,       Obtain the Voter Registration and Permanent Absentee Form from    Downloading the form <a href='https://olvr.hawaii.gov/'> here</a>   Public libraries, or   City halls, or   Phone directories, or   U.S. post offices, or   University of Hawaii systems       Complete the form.   Mail it to the county elections offices listed on the application.    ",
"url":"https://olvr.hawaii.gov/Default.aspx",
"absentee":"coming soon"
},
{
"stateName":"Idaho",
"abbr":"ID",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Have resided in Idaho and in the county for thirty (30) days prior to the day of election   Be at least 18 years old   You have not been convicted of a felony and have had your civil rights restored.    ",
"online":"none",
"inPerson":"   Items required:      A copy of a current and valid photo identification or a copy of a current utility bill, bank statement, government check, paycheck or government document that shows your name and address must be submitted with this form or shown at the polls prior to voting     . To register to vote online,       You can register at the polls on Election Day if you bring proof of ID and Idaho residency, or   Obtain Idaho Voter Registration Form (Form ERM-1) <a href='http://www.idahovotes.gov/VoterReg/voter_registration.pdf'> here</a>   Complete the form.   Return form to the applicable county election office listed on the application.    ",
"mail":"   Items required:      A copy of a current and valid photo identification or a copy of a current utility bill, bank statement, government check, paycheck or government document that shows your name and address must be submitted with this form or shown at the polls prior to voting     . To register to vote online,       Obtain Idaho Voter Registration Form (Form ERM-1) <a href='http://www.idahovotes.gov/VoterReg/voter_registration.pdf'> here</a>   Complete the form.   Mail form to the applicable county election office listed on the application.    ",
"url":"http://www.idahovotes.gov/voter_info.shtml",
"absentee":"coming soon"
},
{
"stateName":"Illinois",
"abbr":"IL",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   You must be 17 years old on or before the date of the Primary Election and turn 18 on or before the date of the General Election.   You must live in your election precinct at least 30 days prior to Election Day.   Not be convicted and in jail.   Not claim the right to vote anywhere else.    ",
"online":"   Items required:      Your Illinois Drivers License or Illinois State ID number.   Date the license or ID was issued.   The last four digits of your social security number.  <liYour birth date.     . To register to vote online,       Visit the state's <a href='https://ova.elections.il.gov/Step0.aspx'> Online Voter Registration System</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Valid Illinois Drivers License or Illinois State ID number and 2 documents proving identification. 1 document must show your current address, or   The last 4 digits of your SSN and a valid photo identification, and a copy of a document proving your residential address      . To register to vote online,     You can register to vote in person at:      Board of Election Commissioner's Office.   County Clerk's Office   City and Village Offices.   Military Recruitment Offices.   Township Offices.   Schools   Public Libraries.    ",
"mail":"   Items required:      Valid Illinois Drivers License or Illinois State ID number and 2 documents proving identification. 1 document must show your current address, or   The last 4 digits of your SSN and a valid photo identification, and a copy of a document proving your residential address      . To register to vote online,       Obtain Illinois Voter Registration Application (Form SBE R-19) <a href='http://www.elections.il.gov/Downloads/VotingInformation/PDF/R-19.pdf'> here</a>   Complete the form.   Mail form to your local election authority. Address found <a href='http://www.elections.il.gov/ElectionAuthorities/ElecAuthorityList.aspx'> here</a>    ",
"url":"https://www.elections.il.gov/votinginformation/register.aspx",
"absentee":"coming soon"
},
{
"stateName":"Indiana",
"abbr":"IN",
"eligibility":"  Eligibility to register      You are both a U.S. citizen and a resident of Indiana.   You will be at least 18 years of age on or before the next General or Municipal Election.   You are not currently in prison after being convicted of a crime.   You have lived in the precinct where you vote for at least 30 days prior to the election    ",
"online":"   Items required:      valid Indiana driver’s license   Indiana state-issued identification card (In lieu of drivers license)     . To register to vote online,       Visit <a href='https://indianavoters.in.gov/PublicSite/OVR/Introduction.aspx?Link=Polling'>this website</a>   Fillout the online registration form above    ",
"inPerson":"   Items required:      State voter registration form (VRG-7)   County voter registration form (VRG-11)     . To register to vote online,       Download and fillout <a href='https://forms.in.gov/Download.aspx?id=9341'>this form</a>   Return the completed form to your county’s voter registration office or the Indiana Election Division.   You can also apply in person at the voter registration or county clerk’s office, or apply in person at any BMV license branch.   Once you registration form is received it will be processed.   If the form is accepted a voter registration acknowledgment card will be sent to your address.   If the form is denied a notice will be sent to your address.    ",
"mail":"   Items required:      State voter registration form (VRG-7)   County voter registration form (VRG-11)     . To register to vote online,       Download and fillout <a href='https://forms.in.gov/Download.aspx?id=9341'>this form</a>   Return the completed form to your county’s voter registration office or the Indiana Election Division using the mailing addresses on the form.   Once you registration form is received it will be processed.   If the form is accepted a voter registration acknowledgment card will be sent to your address.   If the form is denied a notice will be sent to your address.    ",
"url":"http://www.in.gov/sos/elections/2403.htm",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Iowa",
"abbr":"IA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident of Iowa.   Be at least 17 1/2 years old. You must be at least 18 years old by the election date to be able to vote.   NOT be registered to vote in any other state.   NOT be incarcerated, on parole, on probation, or have outstanding monetary obligations from your felony conviction.   NOT be judged mentally incompetent to vote by a court.    ",
"online":"   Items required:      valid Iowa driver’s license or ID number     . To register to vote online,       Visit <a href='https://mymvd.iowadot.gov/Account/Login?ReturnUrl=%2fVoterRegistration'>this website</a>   Fillout the online registration form.     ",
"inPerson":"   Items required:      Registration form.     . To register to vote online,       Download <a href='https://sos.iowa.gov/elections/pdf/voteapp.pdf'>this form.</a>   Bring the form to your <a href='https://sos.iowa.gov/elections/pdf/voteapp.pdf'> county auditor’s office.</a>   Please note that the form must be signed.   Your county auditor will send you a voter registration card within two weeks if the form is accepted.   Pre-registration must be completed 10 days before general elections or 11 days before all other elections.    ",
"mail":"   Items required:      Registration form.     . To register to vote online,       Download <a href='https://sos.iowa.gov/elections/pdf/voteapp.pdf'>this form.</a>   Mail the form to your <a href='https://sos.iowa.gov/elections/pdf/voteapp.pdf'> county auditor’s office.</a>   Please note that the form must be signed.   Your county auditor will send you a voter registration card within two weeks if the form is accepted.   Pre-registration must be completed 10 days before general elections or 11 days before all other elections.      Additionally you can register at the polls on election day if you an Iowa drivers license or the following forms of ID.      Iowa non-driver ID card   Out-of-state driver's license or non-driver ID card   U.S. passport   U.S. military ID   ID card issued by employer   Student ID issued by Iowa high school or college     If that form does not include an address you will need a proof of residence such as the following:      Residential lease   Utility bill (including a cell phone bill)   Bank statement   Paycheck   Government check or other government document    ",
"url":"http://www.in.gov/sos/elections/2403.htm",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Kansas",
"abbr":"KS",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident of Kansas.   Be at least 17 years old (and 18 years old by Election Day to vote).   NOT be disqualified to vote by a court, due to mental incompetence.   NOT be registered to vote in another state.   NOT be incarcerated, on parole or on probation for a felony conviction.    ",
"online":"   Items required:      A Kansas driver's license or non-driver ID card   Proof of your U.S. residency, if registering for the first time     . To register to vote online,       Visit <a href='https://www.kdor.ks.gov/Apps/VoterReg/Default.aspx'>this website</a>   Fillout the online registration form.   Scan you proof of citizenship, then email the copy to your <a href='http://www.kssos.org/elections/elections_registration_ceo_display.aspx'>county election office</a>    ",
"inPerson":"   Items required:      Registration form.   Proof of U.S. citizenship     . To register to vote online,       Download <a href='http://www.sos.ks.gov/forms/elections/voterregistration.pdf'>this form.</a>   Bring the form to your <a href='http://www.sos.ks.gov/elections/elections_registration_ceo.asp'> county election officer's office.</a>   Please note that the form must be signed.   Your county auditor will send you a voter registration card within two weeks if the form is accepted.   Pre-registration must be completed 10 days before general elections or 11 days before all other elections.    ",
"mail":"   Items required:      Registration form.   Proof of U.S. citizenship     . To register to vote online,       Download <a href='http://www.sos.ks.gov/forms/elections/voterregistration.pdf'>this form.</a>   Mail the form to your <a href='http://www.sos.ks.gov/elections/elections_registration_ceo.asp'> county election officer's office.</a>   Please note that the form must be signed.   Your county auditor will send you a voter registration card within two weeks if the form is accepted.   Pre-registration must be completed 10 days before general elections or 11 days before all other elections.    ",
"url":"http://www.in.gov/sos/elections/2403.htm",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Kentucky",
"abbr":"KY",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident in Kentucky for at least 28 days.   You're at least 18 years old (or will be by the date of the next general election). If you'll be 18 years old by the November general election date, you are eligible to vote in the May primary election.)   You have not been deemed mentally incompetent and had your voting rights revoked.   NOT have been convicted for a felony.    ",
"online":"   Items required:      Social Security Number   Date of Birth     . To register to vote online,       Visit <a href='https://vrsws.sos.ky.gov/ovrweb/'>this website</a>   Fillout the online registration form.     ",
"inPerson":"   Items required:      Registration form.     . To register to vote online,       Download <a href='http://elect.ky.gov/SiteCollectionDocuments/Register%20to%20Vote/Kentucky%20Voter%20Registration%20Card.pdf'>this form.</a>   Bring the filled in form to your <a href='http://elect.ky.gov/contactcountyclerks/pages/default.aspx'> county clerk's office.</a>    ",
"mail":"   Items required:      Registration form.     . To register to vote online,       Download <a href='http://elect.ky.gov/SiteCollectionDocuments/Register%20to%20Vote/Kentucky%20Voter%20Registration%20Card.pdf'>this form.</a>   Bring the filled in form to your <a href='http://elect.ky.gov/contactcountyclerks/pages/default.aspx'> county clerk's office.</a>    ",
"url":"http://www.in.gov/sos/elections/2403.htm",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"louisiana",
"abbr":"LA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   You're a Louisiana resident in the parish in which you want to vote.   You're at least 17 years old, and will be 18 years old in time for the election   NOT deemed mentally incompetent or otherwise had your voting rights suspended under judgment.   NOT ot currently incarcerated, on parole, or on probation for a felony conviction.    ",
"online":"   Items required:      Driver's license number or special identification card number   Audit code   Social Security number     . To register to vote online,       Visit <a href='https://voterportal.sos.la.gov/VoterRegistrationx'>this website</a>   Fillout the online registration form.    ",
"inPerson":"   Items required:      Registration form.   Proof of U.S. citizenship     . To register to vote online,       Download <a href='http://www.sos.la.gov/ElectionsAndVoting/PublishedDocuments/ApplicationToRegisterToVote.pdf'>this form.</a>   Bring the form to your <a href='https://voterportal.sos.la.gov/Registrar'> Registrar of Voters' office.</a>   You must bring roof of age, residency and identity.    ",
"mail":"   Items required:      Registration form.   Proof of U.S. citizenship     . To register to vote online,       Download <a href='http://www.sos.la.gov/ElectionsAndVoting/PublishedDocuments/ApplicationToRegisterToVote.pdf'>this form.</a>   Mail the form to your <a href='https://voterportal.sos.la.gov/Registrar'> Registrar of Voters' office.</a>   You must bring roof of age, residency and identity.    ",
"url":"http://www.dmv.org/la-louisiana/voter-registration.php",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Maine",
"abbr":"ME",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   You have a fixed residency in Maine.   You're 18 years old or will be by the next general election    ",
"online":"none",
"inPerson":"   Items required:      ME driver's license or ID card number   The last 4 digits of your Social Security number (In lieu of license)     . To register to vote online,       Download <a href='http://www.maine.gov/sos/cec/elec/data/voterregcard2016.pdf'>this form.</a>   Bring the form to your <a href='http://www.maine.gov/sos/cec/elec/munic.html'>Municipal Registrar's office.</a>    ",
"mail":"   Items required:      ME driver's license or ID card number   The last 4 digits of your Social Security number (In lieu of license)     . To register to vote online,       Download <a href='http://www.maine.gov/sos/cec/elec/data/voterregcard2016.pdf'>this form.</a>   Mail the form to your <a href='http://www.maine.gov/sos/cec/elec/munic.html'>Municipal Registrar's office.</a>    ",
"url":"http://www.dmv.org/me-maine/voter-registration.php",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Maryland",
"abbr":"MD",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident of Maryland.   Be at least 16 years old. You must be 18 years old to vote in an election   Convicted of buying or selling votes.   Disqualified to vote by a court (due to mental incompetency).   Currently incarcerated for a felony conviction.    ",
"online":"   Items required:      The MD MVA must have your name, date of birth, and ID number on file   You must provide the last 4 digits of your Social Security number     . To register to vote online,       Visit <a href='https://voterservices.elections.maryland.gov/OnlineVoterRegistration/InstructionsStep1'>this website</a>   Fillout the online registration form above    ",
"inPerson":"   Items required:      None     . To register to vote online,       Download <a href='http://www.elections.state.md.us/voter_registration/documents/English_Internet_VRA.pdf'>this form.</a>   Bring the form to your <a href='http://www.elections.state.md.us/about/county_boards.html'>Local Board of Election's office.</a>   Once your application is processed, you'll receive a voter identification card within 3 weeks.    ",
"mail":"   Items required:      None     . To register to vote online,       Download <a href='http://www.elections.state.md.us/voter_registration/documents/English_Internet_VRA.pdf'>this form.</a>   mail the form to your <a href='http://www.elections.state.md.us/about/county_boards.html'>Local Board of Election's office.</a>   Once your application is processed, you'll receive a voter identification card within 3 weeks.    ",
"url":"http://www.dmv.org/me-maine/voter-registration.php",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Massachusetts",
"abbr":"MA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident of Massachusetts.   Be At least ​16 years old to pre-register. (To vote you must be 18 years old on or before Election Day).   Are not currently incarcerated due to a felony conviction.    ",
"online":"   Items required:      A valid driver's license or learner's permit issued by Massachusetts   A valid non-driver ID card issued by Massachusetts (In lieu of a drivers license)   Have your signature on record at the MA Registry of Motor Vehicles     . To register to vote online,       Visit <a href='https://www.sec.state.ma.us/ovr/'>this website</a>   Fillout the online registration form above    ",
"inPerson":"   Items required:      None     . To register to vote online,       Visit your <a href='https://www.sec.state.ma.us/ele/eleclk/clkidx.htm'>Local Election office.</a> and ask to register to vote.   When registering to vote in person, you'll fill out an affidavit of registration. You must answer all questions truthfully.   If you are registering to vote for the first time in MA, you must attach a proof of ID to your voter registration form.    ",
"mail":"   Items required:      None     . To register to vote online,       Download <a href='http://www.sec.state.ma.us/ele/elepdf/Voter-reg-mail-in.pdf'>this form.</a>   mail the form to your <a href='http://www.sec.state.ma.us/ele/eleclk/clkidx.htm'>Local Election office.</a>   Your confirmation notice will be mailed to you.   If you are registering to vote for the first time in MA, you must attach a proof of ID to your voter registration form.    ",
"url":"http://www.dmv.org/ma-massachusetts/voter-registration.php",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Michigan",
"abbr":"MI",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be a resident of Michigan, and of the city/township you're registering in.   Be at least 18 years old by the next election date   NOT currently imprisoned for a felony offense.    ",
"online":"none",
"inPerson":"   Items required:       Michigan driver license or personal ID card    Last four digits of your SSN     . To register to vote online,       Download <a href='http://www.michigan.gov/documents/MIVoterRegistration_97046_7.pdf'>this form.</a>   Bring the form to your <a href='https://vote.michigan.gov/mvic/clerksearch.aspx'>Local or township Clerk.</a>   Once your form has been processed, your city or township clerk will issue you a MI voter identification card.   If you're registering for the first time and submitting your application by mail, you will be required to submit a copy of your photo identification.    ",
"mail":"   Items required:      None     . To register to vote online,       Download <a href='http://www.michigan.gov/documents/MIVoterRegistration_97046_7.pdf'>this form.</a>   mail the form to your <a href='http://www.sec.state.ma.us/ele/eleclk/clkidx.htm'>Local Election office.</a>   Your confirmation notice will be mailed to you.   If you are registering to vote for the first time in MA, you must attach a proof of ID to your voter registration form.    ",
"url":"http://www.dmv.org/ma-massachusetts/voter-registration.php",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Minnesota",
"abbr":"MN",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   Ba a 20 day Minnesota resident.   NOT been convicted of a disqualifying felony.    ",
"online":"   Items required:      Valid Minnesota driver's license or identification card   You may use your Social Security number if you do not have a lisence or identification card     Note that you can register in person on election day. You will need to bring an official photo id (such as your driver's lisence or U.S. Passport)    . To register to vote online,       Visit the state's <a href='https://mnvotes.sos.state.mn.us/VoterRegistration/VoterRegistrationMain.aspx'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"none",
"mail":"   Items required:      Valid Nebraska driver's license or identification card   You may use your Social Security number if you do not have a lisence or identification card     Note that you can register in person on election day. You will need to bring an official photo id (such as your driver's lisence or U.S. Passport)    . To register to vote online,       Obtain State of Minnesota Mail-In Voter Registration Form by filling out and printing an <a href='http://www.sos.state.mn.us/media/1587/voter-registration-application.pdf'> online form request.</a>   Complete State of Minnestota Mail-In Voter Registration Form.    Return form to your county Election Office or the state Secretary of State Office    ",
"url":"http://www.sos.state.mn.us/elections-voting/register-to-vote/",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Mississippi",
"abbr":"MS",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   NOT been convicted of a disqualifying felony.    ",
"online":"none",
"inPerson":"none",
"mail":"   Items required:      Valid Mississippi driver's license or identification card   You may use your Social Security Number if you do not have a lisence     . To register to vote online,       Obtain State of Mississippi Mail-In Voter Registration Form by filling out and printing an <a href='http://www.sos.ms.gov/Elections-Voting/Documents/Voter_Registration.pdf'> online form request.</a>   Complete State of Mississippi Mail-In Voter Registration Form.    Return form to your Circuit Clerk's Office    ",
"url":"http://www.sos.ms.gov/Elections-Voting/Pages/Voter-Registration-Information.aspx",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Missouri",
"abbr":"MO",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 17.5 years old.   Be a Missouri resident.     ",
"online":"none",
"inPerson":"   Items required:      Valid Missouri driver's license   Social Security Number     . To register to vote online,       You can receive and fill out a paper form at the following places:    County Clerk's Office   Dpartment of Motor Vehicles Office   Other state Agencies that offer state public assistance        ",
"mail":"   Items required:      Valid Missouri driver's license   Social Security Number     . To register to vote online,       Obtain State of Missouri Mail-In Voter Registration Form by filling out and printing an <a href='https://www.sos.mo.gov/elections/goVoteMissouri/print'> online form request.</a> Note that your form varies with each county.    Complete State of Missouri Mail-In Voter Registration Form.    Return form to your local Election authority.    ",
"url":"https://www.sos.mo.gov/elections/goVoteMissouri/register",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Montana",
"abbr":"MT",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   Be a 30 day Montana Resident.   NOT been convicted of a disqualifying felony.   NOT be declared mentally incompetent by a court.    ",
"online":"none",
"inPerson":"   Items required:      Valid Montana driver's license or identification card   You may use your Social Security Number if you do not have a lisence     . To register to vote online,     Note that you may fill out a registration form when you apply for or renew your driver's license or State of Montana ID at the office where you apply for or renew your Montana driver’s license.       Visit your county election office Monday through Friday between the hours of 8 a.m. and 5 p.m. and complete a registration form   Fill out and sign a voter registration application and drop it off at your county election office, or mail it to the county election administrator.   Return form to your county Election Official    ",
"mail":"   Items required:      Valid Montana driver's license or identification card   You may use your Social Security Number if you do not have a lisence     . To register to vote online,       Obtain State of Montana Mail-In Voter Registration Form by filling out and printing an <a href='https://sos.mt.gov/portals/142/Elections/Forms/Voter_Registration_Application.pdf?dt=1499711079898'> online form request.</a>   Complete State of Montana Mail-In Voter Registration Form.    Return form to your county Election Administrator    ",
"url":"https://sos.mt.gov/elections/vote#370474451-how-to-register-to-vote",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Nebraska",
"abbr":"NE",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   NOT been convicted of a disqualifying felony.   NOT be declared mentally incompetent by a court.    ",
"online":"   Items required:      Valid Nebraska driver's license or identification card     . To register to vote online,       Visit the state's <a href='https://www.nebraska.gov/apps-sos-voter-registration'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"   Items required:      Valid Nebraska driver's license or identification card   Social Security Number     . To register to vote online,       Obtain State of Nebraska Mail-In Voter Registration Form by mail by filling out and printing the <a href='http://www.sos.ne.gov/elec/pdf/vr-fillable.pdf'> online form request</a>   Complete State of Nebraska Mail-In Voter Registration Form.    Return form to your county Election Official   You can also receive a paper form at the following places:    County Election Office   Dpartment of Motor Vehicles Office   Libraries   Post Offices   Other offices that offer state public assistance        ",
"mail":"   Items required:      Valid Nebraska driver's license or identification card   Social Security Number     . To register to vote online,       Obtain State of Nebraska Mail-In Voter Registration Form by filling out and printing an <a href='http://www.sos.ne.gov/elec/pdf/vr-fillable.pdf'> online form request.</a>   Complete State of Nebraska Mail-In Voter Registration Form.    Return form to your county Election Official   You can also receive a paper form at the following places:    County Election Office   Dpartment of Motor Vehicles Office   Libraries   Post Offices   Other offices that offer state public assistance        ",
"url":"https://www.nebraska.gov/apps-sos-voter-registration",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Nevada",
"abbr":"NV",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   Be a 30 day Nevada resident.   Must be residing in the County you are registering in when you are voting     ",
"online":"   Items required:      Valid Nevada driver's license or identification card     . To register to vote online,       Visit the state's <a href='http://nvsos.gov/sos/elections/voters/registering-to-vote'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form. Note that this service is not always available (see site for more infomration).    ",
"inPerson":"   Items required:      Valid Nebraska driver's license or identification card     . To register to vote online,       Obtain State of Nevada Mail-In Voter Registration Form by filling out and printing the <a href='http://www.sos.ne.gov/elec/pdf/vr-fillable.pdf'> online form request</a>   Complete State of Nevada Mail-In Voter Registration Form.    Return form to your county's clerk or Registar of Voters    ",
"mail":"   Items required:      Valid Nevada driver's license or identification card     . To register to vote online,       You can receive and fill out a paper form at the following places:    Dpartment of Motor Vehicles Office   County clerk or Registrar of Voter's Office   Various Social Service Agencies   College Campuses        ",
"url":"http://nvsos.gov/sos/elections/voters/registering-to-vote",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"New Hampshire",
"abbr":"NH",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   Must be residing in the County you are registering in when you are voting at least 10 days before the election.    ",
"online":"none",
"inPerson":"   Items required:      Valid New Hampshire driver's license or identification card     Note that you may register in person at the polling place on election day. In this case, you will be asked to show proof of age, citizenship and domicile.    . To register to vote online,  Otherwise      Apply to your town or city clerk’s office. You will be required to fill out a standard voter registration form and will be required to show proof of age, citizenship and domicile.    It may be easier for you to register with your community’s Supervisors of the Checklist. By law, they are required to meet on the Saturday 10 days prior to each election. Check the local newspaper(s) or call your clerk’s office for the date and time of such meeting.   Complete State of Nevada Mail-In Voter Registration Form.     ",
"mail":"none",
"url":"http://sos.nh.gov/RegVote.aspx",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"New Jersey",
"abbr":"NJ",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 17 years old.   Be a 30 Day New Jersey Resident.   NOT been convicted of a disqualifying felony or be on probation.    ",
"online":"none",
"inPerson":"none",
"mail":"   Items required:      Valid New Jersey driver's license or MVC identification card   If you do not have a liscence or card, you can use your social security number     . To register to vote online,       Obtain a State of New Jersey Mail-In Voter Registration Form by mail by filling out and printing the <a href='http://www.state.nj.us/state/elections/voting-information.html'> online form request</a>. Note that your form varies by county.   Complete State of New Jersey Mail-In Voter Registration Form.    Return form to yCounty Commisioner of Registration or Superintendent of Elections for your county.    ",
"url":"http://www.state.nj.us/state/elections/voting-information.html",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"New Mexico",
"abbr":"NM",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   Be a New Mexico resident.        ",
"online":"   Items required:      Valid New Mexico driver's license or identification card   Social Security Number     . To register to vote online,       Visit the state's <a href='https://portal.sos.state.nm.us/OVR/WebPages/InstructionsStep1.aspx'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"none",
"mail":"   Items required:      Valid New Mexico driver's license or identification card   Social Security Number     . To register to vote online,       Obtain State of New Mexico Mail-In Voter Registration Form by filling out and printing an <a href='https://portal.sos.state.nm.us/OVR/VRForms/VRFormEnglishFinal.pdf'> online form request.</a>   Complete State of New Mexico Mail-In Voter Registration Form.    Return form to your county clerk's office.    ",
"url":"https://portal.sos.state.nm.us/OVR/WebPages/InstructionsStep1.aspx",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"New York",
"abbr":"NY",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   NOT been convicted of a disqualifying felony.    ",
"online":"   Items required:      Valid New York driver's license or identification card   Social Security Number     . To register to vote online,       Visit the state's <a href='https://voterreg.dmv.ny.gov/MotorVoter/'> Electronic Voter Registration Application</a> and follow the prompts as you complete the online form.    ",
"inPerson":"none",
"mail":"none",
"url":"http://www.ny.gov/services/register-vote",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"North Carolina",
"abbr":"NC",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 16 years old.   NOT in prison or have been convicted of a disqualifying felony.    ",
"online":"none",
"inPerson":"none",
"mail":"   Items required:      Valid North Carolina driver's license or identification card   Social Security Number     . To register to vote online,       Obtain State of North Carolina Mail-In Voter Registration Form by filling out and printing an <a href='http://www.ncsbe.gov/Portals/0/FilesP/NCVRRegFormv102013eng.pdf'> online form request.</a>   Complete State of North Carolina Mail-In Voter Registration Form.    Return form to your county Board of Elections   ",
"url":"http://www.ncsbe.gov/Voter-Information/VR-Form",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"North Dakota",
"abbr":"ND",
"eligibility":"  North Dakota is the only state where you do not have to register. When you go to vote, you simply need to present an official ID.    ",
"online":"none",
"inPerson":"none",
"mail":"none",
"url":"https://vip.sos.nd.gov/pdfs/Portals/votereg.pdf",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Ohio",
"abbr":"OH",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   Be a 30 day Ohio Resident.   NOT been convicted of a disqualifying felony.   NOT have previously violated election laws.    ",
"online":"none",
"inPerson":"   Items required:      Valid Ohio driver's license or identification card   Social Security Number     . To register to vote online,       Obtain State of Ohio Mail-In Voter Registration Form by mail by filling out and printing the <a href='https://olvr.sos.state.oh.us/'> online form request</a>   Complete State of Ohio Mail-In Voter Registration Form.    Return form to your county Board of Elections or State Secretary of State office.    You can also receive and fill out a paper form at the following places:    Secretary of State Office   County Board of Elections   High Schools and Vocational Schools   County Treasurer Offices   A number of other state Agencies        ",
"mail":"   Items required:      Valid Ohio driver's license or identification card   Social Security Number     . To register to vote online,       Obtain State of Ohio Mail-In Voter Registration Form by filling out and printing an <a href='https://olvr.sos.state.oh.us/'> online form request.</a>   Complete State of Ohio Mail-In Voter Registration Form.    Return form to your county board of elections or state Secretary of State office.    ",
"url":"http://www.sos.state.oh.us/sos/elections/Voters/register.aspx#register",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Oklahoma",
"abbr":"OK",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 18 years old.   NOT been convicted of a disqualifying felony.   NOT be declared mentally incompetent by a court.    ",
"online":"none",
"inPerson":"none",
"mail":"   Items required:      Valid Oklahoma driver's license   You may use Social Security Number if you do not have a lisence     . To register to vote online,       Obtain State of Oklahoma Mail-In Voter Registration Form by filling out and printing an <a href='https://www.ok.gov/elections/documents/Oklahoma%20Voter%20Registration%20Application%20form%20v4-20%20SEB%20web.pdf'> online form request.</a>   Complete State of Oklahoma Mail-In Voter Registration Form.    Return form to your State Election Board   You can also receive a paper form at the following places:    County Election Board   Libraries   Post Offices   A number of other public locations        ",
"url":"https://www.ok.gov/elections/Voter_Info/Register_to_Vote/",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Oregon",
"abbr":"OR",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be at least 17 years old.   Be an Oregon Resident.    ",
"online":"none",
"inPerson":"   Items required:      Valid Oregon driver's license or identification card   Oregon DMV number   You may use your Social Security number if you do not have a lisence     . To register to vote online,       Go to your County Elections Office to fill out the form.    ",
"mail":"   Items required:      Valid Oregon driver's license or identification card   You may use your Social Security number if you do not have a lisence     . To register to vote online,       Obtain State of Oregon Mail-In Voter Registration Form by mail by filling out and printing the <a href='http://sos.oregon.gov/elections/Documents/SEL500.pdf'> online form request</a>   Complete State of Oregon Mail-In Voter Registration Form.    Return form to your County Elections Office    ",
"url":"http://sos.oregon.gov/voting/Pages/voteinor.aspx",
"absentee":"   Items required:      Item     . To register to vote online,       step1    "
},
{
"stateName":"Pennsylvania",
"abbr":"PA",
"eligibility":"  Eligibility to register      Be a U.S. citizen for at least one month.   Be an Pennsylvania resident, for at least 30 days before the next election.   Be at least 18 years old.   NOT been convicted of a disqualifying felony.    ",
"online":"   Items required:      PA driver's liciense or PennDot ID card number or Social security number     . To register to vote online,       visit this <a href='https://www.pavoterservices.pa.gov/Pages/VoterRegistrationApplication.aspx'>website</a> to register.    ",
"inPerson":"   Items required:      PA driver's liciense or PennDot ID card number or Social security number     . To register to vote online,       fill out the <a href='http://www.dosimages.pa.gov/pdf/OnlineVoterRegFormBlank.pdf'>Pennsylvania Voter Registration Mail Application Form</a>    take the completed form to your county voter registration office    Once your voter registration office processes your application, you will be sent a voter identification card by mail. If you do not receive your PA voter ID card within 14 days, you should contact your county voter registration office directly.    ",
"mail":"   Items required:      PA driver's liciense or PennDot ID card number or Social security number     . To register to vote online,       fill out the <a href='http://www.dosimages.pa.gov/pdf/OnlineVoterRegFormBlank.pdf'>Pennsylvania Voter Registration Mail Application Form</a>    send the completed form to your county voter registration office    Once your voter registration office processes your application, you will be sent a voter identification card by mail. If you do not receive your PA voter ID card within 14 days, you should contact your county voter registration office directly.    ",
"url":"https://www.pavoterservices.pa.gov/Pages/VoterRegistrationApplication.aspx",
"absentee":"   Items required:      Registered to vote in the state of Pennsylvania    The Absentee ballot must be Received by 5:00 p.m. on the Tuesday before Election Day     . To register to vote online,       Make sure you're registered to vote in the state of Pennsylvania   Go to this <a href='http://www.dosimages.pa.gov/pdf/OnlineVoterRegFormBlank.pdf'>website</a> and fill out the form appropriately   Send in your application before the 5 p.m. on the Tuesday before Election day      "
},
{
"stateName":"Rhode Island",
"abbr":"RI",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Rhode Island resident.   Be at least 16 years old(you must be 18 years old to atually vote on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Some form of identification such as DMV-issued driver's license or RI DMV-ID number.     . To register to vote online,       visit this <a href='https://vote.sos.ri.gov'>website</a> to register.   you can check your voter registration status with the registration tool on the website    ",
"inPerson":"   Items required:      Some form of identification such as DMV-issued driver's license or RI DMV-ID number.     . To register to vote online,       fill out the <a href='http://www.elections.ri.gov/publications/Election_Publications/Voter_Registration/December_2012_RI_English_VRF.pdf'>Rhode Island Voter Registration Form</a>    take the completed form to your county voter registration office    Once your voter registration office processes your application, you will be sent a voter identification card by mail. If you do not receive your PA voter ID card within 14 days, you should contact your county voter registration office directly.    ",
"mail":"   Items required:      PA driver's liciense or PennDot ID card number or Social security number     . To register to vote online,       fill out the <a href='http://www.elections.ri.gov/publications/Election_Publications/Voter_Registration/December_2012_RI_English_VRF.pdf'>Rhode Island Voter Registration Form</a>   mail application form to your county's board of canvassers. If you're a first time voter you need to provide ID as well    ",
"url":"http://sos.ri.gov/divisions/elections",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"South Carolina",
"abbr":"RI",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an South Carolina resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires South Carolina License or DMV ID    if you have moved, you must first update your residence address with DMV     . To register to vote online,       visit this <a href='https://info.scvotes.sc.gov/eng/ovr/start.aspx'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires South Carolina License or DMV ID    if you have moved, you must first update your residence address with DMV     . To register to vote online,       Register in person at your <a href='https://www.scvotes.org/how-register-absentee-voting'>county board of voter registration</a>    ",
"mail":"   Items required:      Requires South Carolina License or DMV ID    if you have moved, you must first update your residence address with DMV     . To register to vote online,       visit this <a href='https://www.scvotes.org/files/VR_Blank_Form.pdf'>page</a> to get the registration form.   Return the registration form to your <a href='https://www.scvotes.org/how-register-absentee-voting'>county board of voter registration</a>.     ",
"url":"https://www.scvotes.org/south-carolina-voter-registration-information",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"South Dakota",
"abbr":"SD",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an South Dakota resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"none",
"inPerson":"   Items required:      Requires South Dakota License or Social Security Number    if you have moved, you must first update your residence address with DMV     . To register to vote online,       visit this <a href='https://sdsos.gov/elections-voting/assets/VoterRegistrationFormFillable.pdf'>page</a> to get the registration form.   Return form to    County auditor's office   Driver's license station   City finance office   Public assistance agencies   Department of Human Services office   Military recruiment offices       ",
"mail":"   Items required:      Requires South Dakota License or Social Security Number    if you have moved, you must first update your residence address with DMV     . To register to vote online,       visit this <a href='https://sdsos.gov/elections-voting/assets/VoterRegistrationFormFillable.pdf'>page</a> to get the registration form.   Return form to    County auditor's office   Driver's license station   City finance office   Public assistance agencies   Department of Human Services office   Military recruiment offices       ",
"url":"https://sdsos.gov/elections-voting/voting/register-to-vote/default.aspx",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Tennessee",
"abbr":"TN",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Tennessee resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.    ",
"online":"none",
"inPerson":"   Items required:      Requires Social Security Number     . To register to vote online,       visit this <a href='http://sos-tn-gov-files.s3.amazonaws.com/forms/ss-3010.pdf'>page</a> to get the registration form.   Return form to your County Election Commission    ",
"mail":"   Items required:      Requires Social Security Number     . To register to vote online,       visit this <a href='http://sos-tn-gov-files.s3.amazonaws.com/forms/ss-3010.pdf'>page</a> to get the registration form.   Return form to your County Election Commission    ",
"url":"http://sos.tn.gov/products/elections/how-do-i-register-vote",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Texas",
"abbr":"TX",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Texas resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires Texas License or Social Security Number    if you have moved, you must first update your residence address with DMV     . To register to vote online,       visit this <a href='https://webservices.sos.state.tx.us/vrapp/index.asp'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires Texas Driver's License or Social Security Number     . To register to vote online,       Register in person at your    County Voter Registrars' offices   At Secretary of State office       your voter registration certificate should be mailed to you in 30 days    ",
"mail":"   Items required:      Requires Texas Driver's License or Social Security Number       . To register to vote online,        Request a <a href='https://webservices.sos.state.tx.us/vrrequest/index.asp'>postage-paid application</a> by filling out this form so that a voter registration application can be mailed to you    ",
"url":"http://www.sos.state.tx.us/elections/voter/reqvr.shtml",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Utah",
"abbr":"UT",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Utah resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires Utah's Drivers license or ID card    Address must be up to date in the DLD     . To register to vote online,       visit this <a href='https://secure.utah.gov/voterreg/index.html'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires Utah's Drivers license or ID card    Address must be up to date in the DLD     . To register to vote online,       Register in person at your    Local driver license office   Local county clerk's office        ",
"mail":"   Items required:      Requires Utah's Drivers license or ID card    Address must be up to date in the DLD     . To register to vote online,        Fill out the <a href='https://elections.utah.gov/Media/Default/Forms/Utah%20Voter%20Registration%20Form.pdf'> State of Utah Mail-In Voter Registration Form</a> and send it to your local county clerk's office    ",
"url":"https://secure.utah.gov/voterreg/index.html",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Vermont",
"abbr":"VT",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Vermont resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires Vermont's Drivers license or Current bank statements or utility bill or Governement document showing your current residential address     . To register to vote online,       visit this <a href='https://olvr.sec.state.vt.us/'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires Vermont's Drivers license or Current bank statements or utility bill or Governement document showing your current residential address     . To register to vote online,       Go to your local town/city clerk to get registered    ",
"mail":"none",
"url":"https://olvr.sec.state.vt.us/",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Virginia",
"abbr":"VA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Virginia resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires Virginia's Drivers license or Social Security number     . To register to vote online,       visit this <a href='https://vote.elections.virginia.gov/VoterInformation'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires Virginia's Drivers license or Social Security number     . To register to vote online,       complete the <a href='http://www.sbe.virginia.gov/Files/Forms/VoterForms/VoterRegistrationApplication.pdf'> Voter Registration Application</a> and deliver it to your local voter registration office.    ",
"mail":"   Items required:      Requires Virginia's Drivers license or Social Security number     . To register to vote online,       complete the <a href='http://www.sbe.virginia.gov/Files/Forms/VoterForms/VoterRegistrationApplication.pdf'> Voter Registration Application</a> and deliver it to your local voter registration office.    ",
"url":"https://vote.elections.virginia.gov/VoterInformation",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Washington",
"abbr":"WA",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Washington resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires Washington's Drivers license or Washington ID card     . To register to vote online,       visit this <a href='https://weiapplets.sos.wa.gov/MyVoteOLVR/MyVoteOLVR'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires Washington's Drivers license or Washington ID card     . To register to vote online,       Register in person at the Washington Department of Licensing    ",
"mail":"   Items required:      Requires Washington's Drivers license or Washington ID card     . To register to vote online,       Print or get a copy of the <a href='http://www.sos.wa.gov/_assets/elections/VRF_English_Fillable_WEB.pdf'>Washington State Voter Registration Form</a>.   submit the form to your county election department    ",
"url":"http://www.sos.wa.gov/elections/myvote/olvr.html",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"West Virginia",
"abbr":"WV",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an West Virginia resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires West Virginia's Drivers license or West Virginia's ID card   Social Security Number     . To register to vote online,       visit this <a href='https://ovr.sos.wv.gov/Register/Landing#Landing'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires West Virginia's Drivers license or West Virginia's ID card   Social Security Number     . To register to vote online,       Register in person at the Local West Virginia DMV office or County clerk office    ",
"mail":"   Items required:      Requires West Virginia's Drivers license or West Virginia's ID card   Social Security Number     . To register to vote online,       Print or get a copy of the <a href='http://www.sos.wv.gov/elections/forms/Documents/Forms%20-%20Voter/mail%20in%20voter%20registration%20application.pdf'> West Virginia Voter Registration Application</a>.   submit the form to your county clerk's office    ",
"url":"https://ovr.sos.wv.gov/Register/Landing#Landing",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Wisconsin",
"abbr":"WI",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Wisconsin resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"   Items required:      Requires Wisconsin's Drivers license or Wisconsin ID card   Approved proof of residence      . To register to vote online,       visit this <a href='https://myvote.wi.gov/en-US/RegisterToVote'>page</a> to get registered.    ",
"inPerson":"   Items required:      Requires Wisconsin's Drivers license or Wisconsin ID card   Approved proof of residence      . To register to vote online,       Register in person with your local municipal clerk    ",
"mail":"   Items required:      Requires Wisconsin's Drivers license or Wisconsin ID card   Approved proof of residence      . To register to vote online,       Print or get a copy of the <a href='http://elections.wi.gov/forms/el-131-fillable'> Application for Voter Registration (Form EL-131)</a>.   submit the form to your local municipal clerk(first-time voters must include proof of residency).    ",
"url":"https://myvote.wi.gov/en-US/RegisterToVote",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
},
{
"stateName":"Wyoming",
"abbr":"WY",
"eligibility":"  Eligibility to register      Be a U.S. citizen.   Be an Wyoming resident.   Be at least 18 years old on election day).   NOT been convicted of a disqualifying felony.   Not deemed mentally incompetent by the court    ",
"online":"none",
"inPerson":"   Items required:      Proof of Identification which includes    Wyoming driver's license   Valid U.S passport   School or military ID         . To register to vote online,       If possible, fill out the <a href='http://soswy.state.wy.us/Forms/Elections/General/VoterRegistrationForm.pdf'> Wyoming Voter Registration Application and Change Form</a> before you visit the office, to save you time when you get there.   Register in person with your local town or city clerk    ",
"mail":"   Items required:      Proof of Identification which includes    Wyoming driver's license   Valid U.S passport   School or military ID         . To register to vote online,       Print or get a copy of the <a href='http://soswy.state.wy.us/Forms/Elections/General/VoterRegistrationForm.pdf'> Wyoming Voter Registration Application and Change Form</a>.   You have to fill out the Wyoming Voter Registration Application and Change Form in front of a notary or registry agent   Have the Representitive sign your form and make copies of your proof of ID    ",
"url":"http://soswy.state.wy.us/Elections/Voting.aspx",
"absentee":"   Items required:       Items required:     . To register to vote online,       step    "
} ]}
